HopeFOAM-0.1/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "5";
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
1875
(
(-2.07200459e-05 0.798405379 0)
(-6.16079889e-05 0.901077118 0)
(-0.000100459607 0.958064777 0)
(-0.000136061113 0.999098094 0)
(-0.000167937798 1.03180545 0)
(-0.000195718176 1.05939051 0)
(-0.000219145311 1.0833804 0)
(-0.000238693351 1.10446613 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector>
25
(
(-4.60189677e-09 0.755456613 0)
(-1.47587203e-08 0.858128651 0)
(-2.64999003e-08 0.915116569 0)
(-3.93587271e-08 0.956150227 0)
(-5.31566889e-08 0.988858187 0)
(-6.72937353e-08 1.01644433 0)
(-8.00868045e-08 1.040436 0)
(-9.25824699e-08 1.0615243 0)
...
)
;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.gas;
        value           nonuniform List<vector>
25
(
(-1.81935273e-06 0.839952852 0)
(-5.5367566e-06 0.942622763 0)
(-9.32350916e-06 0.999592511 0)
(-1.30645218e-05 1.04059968 0)
(-1.67172205e-05 1.07327403 0)
(-2.02507623e-05 1.10081724 0)
(-2.36289036e-05 1.12475252 0)
(-2.68232649e-05 1.14576853 0)
...
)
;
    }
    wall1
    {
        type            noSlip;
    }
    wall2
    {
        type            noSlip;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
