HopeFOAM-0.1/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/U.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "5";
    object      U.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
1875
(
(-8.16162354e-06 0.755492887 0)
(-2.43594806e-05 0.858164368 0)
(-4.02824185e-05 0.915151621 0)
(-5.58902387e-05 0.956184543 0)
(-7.11523962e-05 0.988891703 0)
(-8.60406985e-05 1.01647698 0)
(-0.000100536643 1.04046777 0)
(-0.000114681431 1.06155539 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector>
25
(
(-4.60189422e-09 0.755456613 0)
(-1.47587101e-08 0.858128651 0)
(-2.64998953e-08 0.915116569 0)
(-3.93587246e-08 0.956150227 0)
(-5.31566785e-08 0.988858187 0)
(-6.72937327e-08 1.01644433 0)
(-8.00868124e-08 1.040436 0)
(-9.25824754e-08 1.0615243 0)
...
)
;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.liquid;
        value           nonuniform List<vector>
25
(
(-1.76761613e-06 0.761371307 0)
(-5.33310267e-06 0.864041182 0)
(-8.92743679e-06 0.921010822 0)
(-1.24963885e-05 0.962017823 0)
(-1.60004861e-05 0.994691955 0)
(-1.94087877e-05 1.0222349 0)
(-2.26876727e-05 1.04616987 0)
(-2.58124427e-05 1.06718553 0)
...
)
;
    }
    wall1
    {
        type            noSlip;
    }
    wall2
    {
        type            noSlip;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
