HopeFOAM-0.1/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar>
1875
(
119473.51
119473.524
119473.552
119473.593
119473.644
119473.703
119473.77
119473.84
...
)
;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
25
(
1.10023477e-312
9.56803577e-317
0
9.90566442e-317
0.000166643311
6.91152471e-310
9.89394123e-317
0
...
)
;
    }
    outlet
    {
        type            prghPressure;
        p               uniform 100000;
        value           nonuniform List<scalar>
25
(
118815.58
118815.58
118815.58
118815.58
118815.58
118815.58
118815.58
118815.58
...
)
;
    }
    wall1
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
75
(
1.10023477e-312
1.10023477e-312
2.12199579e-314
9.76619289e+11
1.32291928e+180
5.29778802e+151
1.23971581e+224
1.44161265e+214
...
)
;
    }
    wall2
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar>
75
(
1.10023477e-312
1.10023477e-312
9.90713872e-317
9.90713872e-317
0
9.90660117e-317
9.76767782e-321
5.14322337e-321
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
