HopeFOAM-0.1/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/alphat.gas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      alphat.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar>
1875
(
3.28970404e-05
7.47455994e-05
0.000100960341
0.000115723925
0.000119293672
0.000112626917
9.68161763e-05
7.28064561e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar>
25
(
6.06722125e-07
6.06722197e-07
6.0672234e-07
6.06722546e-07
6.06722805e-07
6.06723108e-07
6.06723444e-07
6.06723801e-07
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar>
25
(
2.75713964e-05
6.26776504e-05
8.47184073e-05
9.71888251e-05
0.000100299281
9.4849805e-05
8.17534242e-05
6.17971099e-05
...
)
;
    }
    wall1
    {
        type            compressible::alphatPhaseChangeJayatillekeWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    wall2
    {
        type            compressible::alphatPhaseChangeJayatillekeWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
