HopeFOAM-0.1/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/k.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      k.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar>
1875
(
0.00462107178
0.00438626966
0.00374943216
0.00318948542
0.00265007829
0.00210873598
0.00155763888
0.000999380931
...
)
;

boundaryField
{
    inlet
    {
        type            mapped;
        field       k.liquid;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           nonuniform List<scalar>
25
(
0.00462110009
0.00438636537
0.00374960694
0.00318974621
0.00265043536
0.00210920102
0.00155822206
0.0010000713
...
)
;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 3.75e-05;
        value           nonuniform List<scalar>
25
(
0.00462344763
0.00438930507
0.0037536255
0.00319491789
0.00265685229
0.00211701905
0.00156771466
0.00101143669
...
)
;
    }
    wall1
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar>
75
(
0.00462107178
0.00462108004
0.00462108968
0.00462110012
0.00462111157
0.00462112419
0.00462113809
0.00462115333
...
)
;
    }
    wall2
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar>
75
(
0.00462088389
0.004620904
0.00462091141
0.00462092198
0.00462093332
0.00462094588
0.00462095971
0.00462097491
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
